{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": null,
  "base_model_name_or_path": "HuggingFaceTB/SmolVLM-500M-Instruct",
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "lora_ga_config": null,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.19.1",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "text_model.layers.4.self_attn.k_proj",
    "24.self_attn.q_proj",
    "27.self_attn.q_proj",
    "text_model.layers.10.self_attn.k_proj",
    "text_model.layers.8.self_attn.q_proj",
    "text_model.layers.1.self_attn.q_proj",
    "19.self_attn.k_proj",
    "21.self_attn.q_proj",
    "text_model.layers.7.self_attn.q_proj",
    "21.self_attn.v_proj",
    "text_model.layers.2.self_attn.q_proj",
    "14.self_attn.k_proj",
    "text_model.layers.9.self_attn.k_proj",
    "18.self_attn.q_proj",
    "27.self_attn.k_proj",
    "23.self_attn.q_proj",
    "text_model.layers.9.self_attn.q_proj",
    "text_model.layers.6.self_attn.v_proj",
    "text_model.layers.4.self_attn.q_proj",
    "22.self_attn.v_proj",
    "text_model.layers.0.self_attn.q_proj",
    "23.self_attn.v_proj",
    "25.self_attn.v_proj",
    "26.self_attn.q_proj",
    "text_model.layers.2.self_attn.v_proj",
    "12.self_attn.k_proj",
    "20.self_attn.q_proj",
    "29.self_attn.v_proj",
    "text_model.layers.1.self_attn.k_proj",
    "text_model.layers.8.self_attn.v_proj",
    "24.self_attn.v_proj",
    "24.self_attn.k_proj",
    "text_model.layers.5.self_attn.q_proj",
    "19.self_attn.v_proj",
    "12.self_attn.v_proj",
    "o_proj",
    "27.self_attn.v_proj",
    "14.self_attn.q_proj",
    "text_model.layers.5.self_attn.k_proj",
    "text_model.layers.11.self_attn.k_proj",
    "16.self_attn.v_proj",
    "text_model.layers.4.self_attn.v_proj",
    "13.self_attn.k_proj",
    "18.self_attn.k_proj",
    "text_model.layers.3.self_attn.v_proj",
    "17.self_attn.k_proj",
    "down_proj",
    "28.self_attn.k_proj",
    "31.self_attn.v_proj",
    "text_model.layers.6.self_attn.q_proj",
    "22.self_attn.q_proj",
    "17.self_attn.v_proj",
    "text_model.layers.6.self_attn.k_proj",
    "16.self_attn.q_proj",
    "14.self_attn.v_proj",
    "text_model.layers.7.self_attn.v_proj",
    "26.self_attn.k_proj",
    "22.self_attn.k_proj",
    "15.self_attn.q_proj",
    "23.self_attn.k_proj",
    "up_proj",
    "text_model.layers.0.self_attn.k_proj",
    "20.self_attn.v_proj",
    "25.self_attn.q_proj",
    "15.self_attn.v_proj",
    "30.self_attn.q_proj",
    "21.self_attn.k_proj",
    "text_model.layers.1.self_attn.v_proj",
    "31.self_attn.q_proj",
    "12.self_attn.q_proj",
    "13.self_attn.v_proj",
    "15.self_attn.k_proj",
    "text_model.layers.11.self_attn.q_proj",
    "26.self_attn.v_proj",
    "16.self_attn.k_proj",
    "text_model.layers.2.self_attn.k_proj",
    "28.self_attn.v_proj",
    "text_model.layers.3.self_attn.k_proj",
    "25.self_attn.k_proj",
    "13.self_attn.q_proj",
    "text_model.layers.3.self_attn.q_proj",
    "30.self_attn.k_proj",
    "text_model.layers.10.self_attn.q_proj",
    "19.self_attn.q_proj",
    "29.self_attn.k_proj",
    "text_model.layers.9.self_attn.v_proj",
    "31.self_attn.k_proj",
    "text_model.layers.11.self_attn.v_proj",
    "29.self_attn.q_proj",
    "text_model.layers.5.self_attn.v_proj",
    "text_model.layers.10.self_attn.v_proj",
    "text_model.layers.7.self_attn.k_proj",
    "28.self_attn.q_proj",
    "text_model.layers.0.self_attn.v_proj",
    "gate_proj",
    "18.self_attn.v_proj",
    "text_model.layers.8.self_attn.k_proj",
    "30.self_attn.v_proj",
    "20.self_attn.k_proj",
    "17.self_attn.q_proj"
  ],
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_bdlora": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}